In [1]:
import numpy as np
import seaborn as sns
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 1000)

In [2]:
#########################################
# Görev 1: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.
# Task 1: Load the Titanic dataset from the Seaborn library.
#########################################

#df = sns.load_dataset("titanic")
df = pd.read_csv("/kaggle/input/titanic-dataset-csv/titanic.csv")
df.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third  woman       False  NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000        S  First  woman       False    C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500        S  Third    man        True  NaN  Southampton    no   True

In [3]:
#########################################
# Görev 2: Yukarıda tanımlanan Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.
# Task 2: Find the number of male and female passengers in the Titanic dataset defined above.
#########################################

df["sex"].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [4]:
#########################################
# Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.
# Task 3: Find the number of unique values for each column.
#########################################

df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [5]:
#########################################
# Görev 4: pclass değişkeninin unique değerleri bulunuz.
# Task 4: Find the unique values of the pclass variable.
#########################################

df["pclass"].unique()

array([3, 1, 2])

In [6]:
#########################################
# Görev 5:  pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.
# Task 5: Find the number of unique values for the pclass and parch variables.
#########################################

df[["pclass", "parch"]].nunique()

pclass    3
parch     7
dtype: int64

In [7]:
#########################################
# Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz. Tekrar tipini kontrol ediniz.
# Task 6: Check the type of the embarked variable. Change its type to category. Check its type again.
#########################################

df["embarked"].dtypes

df["embarked"] = df["embarked"].astype("category")

df["embarked"].dtypes

print(df["embarked"].astype("category").dtypes)

category

In [8]:
#########################################
# Görev 7: embarked değeri C olanların tüm bilgelerini gösteriniz.
# Task 7: Show all records where the embarked value is 'C'.
#########################################


df.loc[(df["embarked"] == "C")]

embarked_c = df[df['embarked'] == "C"].head()
print(embarked_c)

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck embark_town alive  alone
1          1       1  female  38.0      1      0  71.2833        C   First  woman       False    C   Cherbourg   yes  False
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
19         1       3  female   NaN      0      0   7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True
26         0       3    male   NaN      0      0   7.2250        C   Third    man        True  NaN   Cherbourg    no   True
30         0       1    male  40.0      0      0  27.7208        C   First    man        True  NaN   Cherbourg    no   True

In [9]:
#########################################
# Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.
# Task 8: Show all records where the embarked value is NOT 'S'.
#########################################

df.loc[(df["embarked"] != "S")]

embarked_s=df[df['embarked']!='S']
embarked_s.head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck embark_town alive  alone
1          1       1  female  38.0      1      0  71.2833        C   First  woman       False    C   Cherbourg   yes  False
5          0       3    male   NaN      0      0   8.4583        Q   Third    man        True  NaN  Queenstown    no   True
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
16         0       3    male   2.0      4      1  29.1250        Q   Third  child       False  NaN  Queenstown    no  False
19         1       3  female   NaN      0      0   7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True

In [10]:
#########################################
# Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.
# Task 9: Show all records where the age is less than 30 and the passenger is female.
#########################################

df.loc[(df["age"]<30) & (df["sex"]=="female")]

female_age_r=df[(df["sex"]=="female") & (df["age"]<30)]
female_age_r.head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck  embark_town alive  alone
2          1       3  female  26.0      0      0   7.9250        S   Third  woman       False  NaN  Southampton   yes   True
8          1       3  female  27.0      0      2  11.1333        S   Third  woman       False  NaN  Southampton   yes  False
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN    Cherbourg   yes  False
10         1       3  female   4.0      1      1  16.7000        S   Third  child       False    G  Southampton   yes  False
14         0       3  female  14.0      0      0   7.8542        S   Third  child       False  NaN  Southampton    no   True

In [11]:
#########################################
# Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.
# Task 10: Show records where the fare is greater than 500 or the age is greater than 70.
#########################################

df.loc[(df["fare"]>500) | (df["age"]>70)]

fare_r=df[(df["fare"]>500) | (df["age"]>70)]
fare_r.head()

     survived  pclass     sex   age  sibsp  parch      fare embarked  class    who  adult_male deck  embark_town alive  alone
96          0       1    male  71.0      0      0   34.6542        C  First    man        True    A    Cherbourg    no   True
116         0       3    male  70.5      0      0    7.7500        Q  Third    man        True  NaN   Queenstown    no   True
258         1       1  female  35.0      0      0  512.3292        C  First  woman       False  NaN    Cherbourg   yes   True
493         0       1    male  71.0      0      0   49.5042        C  First    man        True  NaN    Cherbourg    no   True
630         1       1    male  80.0      0      0   30.0000        S  First    man        True    A  Southampton   yes   True

In [12]:
#########################################
# Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.
# Task 11: Find the total number of missing values for each variable.
#########################################

df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
#########################################
# Görev 12: who değişkenini dataframe'den düşürün.
# Task 12: Drop the who variable from the DataFrame.
#########################################

df.drop('who', axis=1).head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third       False  NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000        S  First       False    C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500        S  Third        True  NaN  Southampton    no   True

In [14]:
#########################################
# Görev 13: deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.
# Task 13: Fill the missing values in the deck variable with the most frequent value (mode) of the deck variable.
#########################################

df['deck'] = df['deck'].fillna(df['deck'].mode()[0])
df['deck'].isnull().sum()

0

In [15]:
#########################################
# Görev 14: age değikenindeki boş değerleri age değişkenin medyanı ile doldurun.
# Task 14: Fill the missing values in the age variable with the median value of the age variable.
#########################################

df['age'] = df['age'].fillna(df['age'].median())
df['age'].isnull().sum()

0

In [16]:
#########################################
# Görev 15: survived değişkeninin Pclass ve Cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.
# Task 15: Find the sum, count, and mean values of the survived variable by the pclass and sex variables.
#########################################

df.groupby(["pclass", "sex"]).agg({"survived": ["sum", "count", "mean"]})

              survived
                   sum count      mean
pclass sex
1      female       91    94  0.968085
       male         45   122  0.368852
2      female       70    76  0.921053
       male         17   108  0.157407
3      female       72   144  0.500000
       male         47   347  0.135447

In [17]:
#########################################
# Görev 16:  30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazınız.
# Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. (apply ve lambda yapılarını kullanınız)

#Task 16: Write a function that assigns 1 to passengers under 30 years old and 0 to those 30 years old and older.
# Create a new variable called age_flag in the Titanic dataset using this function with apply and lambda.
#########################################

def age_funct(age):
    return 1 if age < 30 else 0

#######df['age_flag'] = df['age'].apply(age_funct).head()

df['age_flag'] = df['age'].apply(lambda age: 1 if age < 30 else 0)

df['age_flag'].head()

0    1
1    0
2    1
3    0
4    0
Name: age_flag, dtype: int64

In [18]:
#########################################
# Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.
# Task 17: Load the Tips dataset from the Seaborn library.
#########################################

#df_1 = sns.load_dataset("tips")
df_1 = pd.read_csv("/kaggle/input/tips-dataset-sns/tips.csv")
df_1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
#########################################
# Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill  değerlerinin toplamını, min, max ve ortalamasını bulunuz.
# Task 18: For the categories of the time variable (Dinner, Lunch), find the total, min, max, and average values of the total_bill variable.
#########################################

df_1["time"].value_counts()

df_1.groupby("time").agg({"total_bill": ["sum", "min", "max", "mean"]})

       total_bill
              sum   min    max       mean
time
Dinner    3660.30  3.07  50.81  20.797159
Lunch     1167.47  7.51  43.11  17.168676

In [20]:
#########################################
# Görev 19: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.
# Task 19: For each day and time, find the total, min, max values of the total_bill variable.
#########################################

df_1.groupby(["time", "day"]).agg({"total_bill": ["sum", "min", "max"]})

            total_bill
                   sum    min    max
time   day
Dinner Fri      235.96   5.75  40.17
       Sat     1778.40   3.07  50.81
       Sun     1627.16   7.25  48.17
       Thur      18.78  18.78  18.78
Lunch  Fri       89.92   8.58  16.27
       Thur    1077.55   7.51  43.11

In [21]:
#########################################
# Görev 20:Lunch zamanına ve kadın müşterilere ait total_bill ve tip  değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.
# Task 20: For Lunch time and female customers, find the total, min, max, and average values of total_bill and tip by day.
#########################################


female_lunch = df_1.loc[(df_1["time"]=="Lunch") & (df_1["sex"]=="Female")]
female_lunch_agg = female_lunch.groupby("day").agg({"total_bill": ["sum", "min", "max", "mean"],
                                 "tip": ["sum", "min", "max", "mean"]})

female_lunch.head()

     total_bill   tip     sex smoker   day   time  size
82        10.07  1.83  Female     No  Thur  Lunch     1
85        34.83  5.17  Female     No  Thur  Lunch     4
117       10.65  1.50  Female     No  Thur  Lunch     2
118       12.43  1.80  Female     No  Thur  Lunch     2
119       24.08  2.92  Female     No  Thur  Lunch     4

In [22]:
#########################################
# Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir?
# Task 21: What is the average of orders where the size is less than 3 and total_bill is greater than 10?
#########################################

df_1.loc[(df_1["size"] < 3) & (df_1["total_bill"] >10 ) , "total_bill"].mean()

17.184965034965035

In [23]:
#########################################
# Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturun. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.
# ask 22: Create a new variable called total_bill_tip_sum which is the sum of total_bill and tip for each customer.
#########################################


df_1["total_bill_tip_sum"] = df_1["total_bill"] + df_1["tip"]
df_1[["total_bill_tip_sum", "total_bill", "tip"]].head()

   total_bill_tip_sum  total_bill   tip
0               18.00       16.99  1.01
1               12.00       10.34  1.66
2               24.51       21.01  3.50
3               26.99       23.68  3.31
4               28.20       24.59  3.61

In [24]:
#########################################
# Görev 23: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.
# Task 23: Sort by the total_bill_tip_sum variable in descending order and assign the top 30 entries to a new DataFrame.
#########################################



df_2 = df_1.sort_values(by='total_bill_tip_sum', ascending=False)[:20]
print(df_2)

     total_bill    tip     sex smoker   day    time  size  total_bill_tip_sum
170       50.81  10.00    Male    Yes   Sat  Dinner     3               60.81
212       48.33   9.00    Male     No   Sat  Dinner     4               57.33
59        48.27   6.73    Male     No   Sat  Dinner     4               55.00
156       48.17   5.00    Male     No   Sun  Dinner     6               53.17
182       45.35   3.50    Male    Yes   Sun  Dinner     3               48.85
197       43.11   5.00  Female    Yes  Thur   Lunch     4               48.11
23        39.42   7.58    Male     No   Sat  Dinner     4               47.00
102       44.30   2.50  Female    Yes   Sat  Dinner     3               46.80
142       41.19   5.00    Male     No  Thur   Lunch     5               46.19
95        40.17   4.73    Male    Yes   Fri  Dinner     4               44.90
184       40.55   3.00    Male    Yes   Sun  Dinner     2               43.55
112       38.07   4.00    Male     No   Sun  Dinner     3               42.07
207       38.73   3.00    Male    Yes   Sat  Dinner     4               41.73
56        38.01   3.00    Male    Yes   Sat  Dinner     4               41.01
141       34.30   6.70    Male     No  Thur   Lunch     6               41.00
238       35.83   4.67  Female     No   Sat  Dinner     3               40.50
11        35.26   5.00  Female     No   Sun  Dinner     4               40.26
52        34.81   5.20  Female     No   Sun  Dinner     4               40.01
85        34.83   5.17  Female     No  Thur   Lunch     4               40.00
47        32.40   6.00    Male     No   Sun  Dinner     4               38.40